openfoam/tutorials/preProcessing/PDRsetFields/simplePipeCage/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue p       100000
    volScalarFieldValue T       287
    volScalarFieldValue Tu      287
    volScalarFieldValue ft      0
);

regions
(
    boxToCell
    {
        box    (0 0 0) (3.0 3.0 2.0);

        fieldValues
        (
            volScalarFieldValue ft 0.0659567323835564
        );
    }
);


// ************************************************************************* //
